---
kind: other
id: Properties.T:Autodesk.Revit.DB.GeometryElement
source: html/3a01dabc-c357-1b89-a32e-ebdb9c7e3aaa.htm
---
# GeometryElement Properties

The ElementId of the GeometryObject's GraphicsStyle